#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/davinci/captain-hook-lambda-dev/runs/run-rNwGcd4mLUHVEeoP

Waiting for the plan to start...

Terraform v1.8.4
on linux_amd64
Initializing plugins and modules...
data.archive_file.python_lambda_package: Refreshing...
data.archive_file.python_lambda_package: Refresh complete after 0s [id=67dc0af9cafb4f3eaee0659aadc39040dc64553e]
data.aws_region.current: Refreshing...
data.aws_iam_policy_document.lambda: Refreshing...
data.aws_caller_identity.current: Refreshing...
data.aws_region.current: Refresh complete after 0s [id=us-east-1]
data.aws_iam_policy_document.lambda: Refresh complete after 0s [id=4274820453]
data.aws_caller_identity.current: Refresh complete after 0s [id=288195736164]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = "AllowFromLambda"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "captain-hook-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "GitHubRepo" = "captain-hook-lambda"
          + "Workspace"  = "captain-hook-lambda"
        }
      + unique_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @jmeisele, Action: `pull_request`*